<font color='green'>

## 08. Birleştirme (Join) İşlemleri

### Elimizde çoğu zaman birden fazla dataframe olacağı için önemli bir konudur.

In [1]:
import numpy as np
import pandas as pd

In [3]:
matris=np.random.randint(1,30,(5,3))
matris

array([[17, 24, 14],
       [ 6,  3,  5],
       [15, 14, 25],
       [17, 18, 10],
       [11,  7, 22]])

### Hatırlatma : ikinci defa paranteze alıp (5,3) yazmamızın nedeni matrisin size'ını belirtmektir. 5'e 3'lük bir matris yapacağımızı python'a söyledik.

In [5]:
dataf1=pd.DataFrame(matris,columns=["var1","var2","var3"])
dataf1

   var1  var2  var3
0    17    24    14
1     6     3     5
2    15    14    25
3    17    18    10
4    11     7    22

### Basit bir toplama işlemi yapalım. Elimizdeki veri seti ile bir rakam toplayalım :

In [6]:
dataf2=dataf1 + 99
dataf2

   var1  var2  var3
0   116   123   113
1   105   102   104
2   114   113   124
3   116   117   109
4   110   106   121

### Veri setindeki tüm değişkenler 99 artmış oldu.

### Şimdi bu iki dataframe'i birleştirelim :

In [7]:
pd.concat([dataf1,dataf2])

   var1  var2  var3
0    17    24    14
1     6     3     5
2    15    14    25
3    17    18    10
4    11     7    22
0   116   123   113
1   105   102   104
2   114   113   124
3   116   117   109
4   110   106   121

### Dikkat edersek index'ler 0'dan 9'a kadar gitmek yerine 0'dan 4'e olacak şekilde 2 kere tekrarlamıştır. Bu pek de istediğimiz birşey değildir. Hemen düzeltelim :

In [9]:
pd.concat([dataf1,dataf2], ignore_index=True)

   var1  var2  var3
0    17    24    14
1     6     3     5
2    15    14    25
3    17    18    10
4    11     7    22
5   116   123   113
6   105   102   104
7   114   113   124
8   116   117   109
9   110   106   121

### Görüldüğü üzere index'lerimiz artık 0'dan 9'a olacak şekilde sıralandı.

### Peki ya dataframe'lerin kolon adı farklı ise sonuç nasıl olur ?

### Öncelikle iki veri setimizin de kolon adlarını ekrana sırasıyla bastıralım ancak yukarıdaki sorumuzu cevaplamak için bir tanesinin kolon adlarını biraz değiştirelim :

In [10]:
dataf1.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [14]:
dataf2.columns = ["var1","yeni2","yeni3"]
dataf2.columns

Index(['var1', 'yeni2', 'yeni3'], dtype='object')

In [15]:
pd.concat([dataf1,dataf2])

C:\Users\GULUM\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   var1  var2  var3  yeni2  yeni3
0    17  24.0  14.0    NaN    NaN
1     6   3.0   5.0    NaN    NaN
2    15  14.0  25.0    NaN    NaN
3    17  18.0  10.0    NaN    NaN
4    11   7.0  22.0    NaN    NaN
0   116   NaN   NaN  123.0  113.0
1   105   NaN   NaN  102.0  104.0
2   114   NaN   NaN  113.0  124.0
3   116   NaN   NaN  117.0  109.0
4   110   NaN   NaN  106.0  121.0

### Çıktısı hata verdi. Hatanın sebebi ise ilk dataframe'de 'var3' ve 'var2' değeri ikinci dataframe'de ise 'yeni3' ve 'yeni2'değeri dataframe'lerde bulunmadığı için NaN olarak sonuç verdi. Bir dataframe'nin diğer dataframe'de karşılığı yoktur. Teknik olarak da aynı bilgileri taşımayan iki dataframe'i birleştirmek mantıklı olmayacaktır.

### Bu sorunu ortadan kaldırmak için iki dataframe'in de ortak değerlerini alarak birleştirelim (Kesişim dışındakileri gereksiz olduğunu düşündüğümüz durumlarda kullanırız.) :

In [16]:
pd.concat([dataf1,dataf2],join="inner")

   var1
0    17
1     6
2    15
3    17
4    11
0   116
1   105
2   114
3   116
4   110

### Ortak olan tek kolon var1 kolonu olduğu için birleştirme sonucu sadece var1 kolonu çıktı olarak ekrana basıldı.

### İki dataframe'deki kesişimine dataframe'in kesişimde olmayan değerini de ekleyelim.

In [18]:
pd.concat([dataf1,dataf2], join_axes=[dataf1.columns])

C:\Users\GULUM\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  var2  var3
0    17  24.0  14.0
1     6   3.0   5.0
2    15  14.0  25.0
3    17  18.0  10.0
4    11   7.0  22.0
0   116   NaN   NaN
1   105   NaN   NaN
2   114   NaN   NaN
3   116   NaN   NaN
4   110   NaN   NaN

### Kesişime sadece 'dataf1' veri setinde bulunan 'var2' ve 'var3' kolonları da dahil edildi.

In [19]:
pd.concat([dataf1,dataf2],join_axes=[dataf2.columns])

C:\Users\GULUM\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  yeni2  yeni3
0    17    NaN    NaN
1     6    NaN    NaN
2    15    NaN    NaN
3    17    NaN    NaN
4    11    NaN    NaN
0   116  123.0  113.0
1   105  102.0  104.0
2   114  113.0  124.0
3   116  117.0  109.0
4   110  106.0  121.0

### Kesişime sadece 'dataf2' veri setinde bulunan 'yeni2' ve 'yeni3' kolonları da dahil edildi.

### index'lerimizi de düzeltelim :

In [20]:
pd.concat([dataf1,dataf2],join_axes=[dataf2.columns], ignore_index=True)

C:\Users\GULUM\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.
  """Entry point for launching an IPython kernel.

   var1  yeni2  yeni3
0    17    NaN    NaN
1     6    NaN    NaN
2    15    NaN    NaN
3    17    NaN    NaN
4    11    NaN    NaN
5   116  123.0  113.0
6   105  102.0  104.0
7   114  113.0  124.0
8   116  117.0  109.0
9   110  106.0  121.0

### [09. İleri Seviye Birleştirme İşlemleri notlarına geçmek için tıklayınız.](https://github.com/semihstp/Veri-Bilimi-Not-Defterim/blob/master/Pandas%20K%C3%BCt%C3%BCphanesi/09.%20%C4%B0leri%20Seviye%20Birle%C5%9Ftirme%20%C4%B0%C5%9Flemleri.ipynb)